INSERT INTO genres VALUES 
	(1, 'русская поп-музыка'),
	(2, 'танцевальная музыка'),
	(3, 'поп'),
	(4, 'хип-хоп'),
	(5, 'инди'),
	(6, 'рок');

INSERT INTO collections VALUES 
	(1, 'Песни 2022 года', 2022),
	(2, 'Песни из Tik-Tok', 2022),
	(3, 'Музыка 2020-х', 2020),
	(4, 'Хиты 2019', 2019),
	(5, 'Хиты FM 2018', 2018),
	(6, 'Верните мой 2018', 2018),
	(7, 'Лучшие песни 2017 года', 2017),
	(8, 'Саундтреки лета 2016 года', 2016);

INSERT INTO albums VALUES 
	(1, 'Fenix deluxe', 2022),
	(2, 'Моё море', 2021),
	(3, 'Палец пистолет', 2018),
	(4, 'Кредо', 2019),
	(5, 'Девочка, не плачь', 2022),
	(6, 'Single Lady', 2010),
	(7, 'Best Of - The Hit Collection 2001-2007', 2007),
	(8, 'Before The Dinosaurs', 2011),
	(9, 'Music To Be Murdered By', 2020),
	(10, 'Pride', 2019),
	(11, 'Woodstock', 2017),
	(12, 'Black Water', 2018),
	(13, 'Melodrama', 2017),
	(14, 'Malibu', 2016),
	(15, 'Summer Songs 2', 2016),
	(16, 'Мой рай', 2007),
	(17, 'Transmissions', 2014),
	(18, 'Stories', 2017);

INSERT INTO tracks VALUES 
	(1, 'по барам',  237, 1),
	(2, 'мне страшно любить тебя', 138, 2),
	(3, 'Забыла, не помню', 241, 3),
	(4, 'Кредо', 202, 4),
	(5, 'Материк', 155, 5),
	(6, 'Single Lady', 197, 6),
	(7, 'Forgiven', 206, 7),
	(8, 'Friends', 221, 8),
	(9, 'Godzilla', 210, 9),
	(10, 'Алые-алые', 191, 10),
	(11, 'Feel It Still', 162, 11),
	(12, 'Drunk Groove', 226, 12),
	(13, 'Green Light', 234, 13),
	(14, 'Come down', 176, 14),
	(15, 'King of teens', 135, 15),
	(16, 'Мой рай', 215, 16),
	(17, 'My demons', 288, 17),
	(18, 'Важные фразы', 221, 18);

INSERT INTO artists VALUES
	(1, 'ANNA ASTI'),
	(2, 'Nicebeatzprod'),
	(3, 'Планка'),
	(4, 'GAYAZOV$ BROTHER$'),
	(5, 'Артём Качер'),
	(6, 'Ани Лорак'),
	(7, 'Dj Layla'),
	(8, 'Dee-Dee'),
	(9, 'Sylver'),
	(10, 'Aura Dione'),
	(11, 'Eminem'),
	(12, 'Juice WRLD'),
	(13, 'RASA'),
	(14, 'Portugal. The Man'),
	(15, 'MARUV'),
	(16, 'BOOSIN'),
	(17, 'Lorde'),
	(18, 'Anderson .Paak'),
	(19, 'Lil Yachty'),
	(20, 'МакSим'),
	(21, 'Starset');

INSERT INTO artist_genres VALUES 
	(1, 1), (2, 1), (3, 1), (4, 1), (5, 1),
	(6, 1), (7, 2), (8, 2), (9, 2), (10, 3),
	(11, 4), (12, 4), (13, 1), (14, 5), (15, 1), (15, 2),
	(16, 2), (17, 3), (18, 4), (19, 4), (20, 1), (21, 6);

INSERT INTO album_artists VALUES 
	(1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (5, 6),
	(6, 7), (6, 8), (7, 9), (8, 10), (9, 11), (9, 12),
	(10, 13), (11, 14), (12, 15), (12, 16), (13, 17), 
	(14, 18), (15, 19), (16, 20), (17, 21), (18, 15);

INSERT INTO collection_tracks VALUES 
	(1, 1), (1, 2), (1, 3), (1, 4), (1, 5),
	(2, 6), (2, 7), (2, 8), (3, 9), (4, 10),
	(5, 11), (6, 12), (7, 13), (8, 14), (8, 15);